{
  "_class_name": "Kandinsky5Transformer3DModel",
  "_diffusers_version": "0.33.0.dev0",
  "in_visual_dim": 16,
  "out_visual_dim": 16,
  "time_dim": 1024,
  "patch_size": [1, 2, 2],
  "model_dim": 4096,
  "ff_dim": 16384,
  "num_text_blocks": 4,
  "num_visual_blocks": 60,
  "axes_dims": [32, 48, 48],
  "visual_cond": true,
  "in_text_dim": 3584,
  "in_text_dim2": 768,
  "attention_type": "nabla",
  "attention_causal": false,
  "attention_local": false,
  "attention_glob": false,
  "attention_window": 3,
  "attention_method": "topcdf",
  "attention_P": 0.8,
  "attention_add_sta": true,
  "attention_wT": 11,
  "attention_wW": 3,
  "attention_wH": 3
}